import core


row_a = [
    ('а', 'あ'),
    ('и', 'い'),
    ('у', 'う'),
    ('э', 'え'),
    ('о', 'お'),
]
row_ka = [
    ('ка', 'か'),
    ('ки', 'き'),
    ('ку', 'く'),
    ('кэ', 'け'),
    ('ко', 'こ'),
]
row_ta = [
    ('та', 'た'),
    ('чи', 'ち'),
    ('цу', 'つ'),
    ('тэ', 'て'),
    ('то', 'と'),
]
row_sa = [
    ('са', 'さ'),
    ('ши', 'し'),
    ('су', 'す'),
    ('сэ', 'せ'),
    ('со', 'そ'),
]
row_na = [
    ('на', 'な'),
    ('ни', 'に'),
    ('ну', 'ぬ'),
    ('нэ', 'ね'),
    ('но', 'の'),
]
row_ha = [
    ('ха', 'は'),
    ('хи', 'ひ'),
    ('фу', 'ふ'),
    ('хэ', 'へ'),
    ('хо', 'ほ'),
]
row_ma = [
    ('ма', 'ま'),
    ('ми', 'み'),
    ('му', 'む'),
    ('мэ', 'め'),
    ('мо', 'も'),
]
row_ya = [
    ('я', 'や'),
    ('ю', 'ゆ'),
    ('ё', 'よ'),
]
row_ra = [
    ('ра', 'ら'),
    ('ри', 'り'),
    ('ру', 'る'),
    ('рэ', 'れ'),
    ('ро', 'ろ'),
]
row_wa = [
    ('ва', 'わ'),
    ('(в)о', 'を'),
]
row_n = [
    ('н', 'ん'),
]

kana = row_a + row_ka + row_ta + row_sa + row_na + row_ha + row_ma + \
       row_ya + row_ra + row_wa + row_n


if __name__ == '__main__':
    core.learn(kana)
