import core


numbers = [
    ('0', 'れい [рэй]'),
    ('1', 'いち [ичи]'),
    ('2', 'に [ни]'),
    ('3', 'さん [сан]'),
    ('4', 'よん [ён]'),
    ('4 (кит.)', 'し [ши]'),
    ('5', 'ご [го]'),
    ('6', 'ろく [року]'),
    ('7', 'なな [нана]'),
    ('7 (кит.)', 'しち [шичи]'),
    ('8', 'はち [хачи]'),
    ('9', 'きゅう [кюю]'),
    ('10', 'じゅう [дзюю]'),
    ('15', 'じゅうご [дзюю го]'),
    ('28', 'にジュちく [ни дзюю чику]'),
    # age
    ('1 год', 'いっさい [иссаИ]'),
    ('8 лет', 'はっさい [хассаИ]'),
    ('10 лет', 'じゅっさい [дзюссаИ]'),
    ('20 (лет)', 'じゅう [ханичИ]'),
]


if __name__ == '__main__':
    core.learn(numbers)
